In [1]:
import numpy as np
import pandas as pd

In [2]:
registrations = pd.DataFrame({'reg_id' :[1,2,3,4],'name':['Andrew','Bob','Claire','David']})

In [3]:
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bob']})

In [4]:
registrations

   reg_id    name
0       1  Andrew
1       2     Bob
2       3  Claire
3       4   David

In [5]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [6]:
pd.merge(logins,registrations,how='outer',on='name')

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0      Bob     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [7]:
registrations = registrations.set_index('name')

In [8]:
registrations

        reg_id
name
Andrew       1
Bob          2
Claire       3
David        4

In [9]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [10]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4     Bob

In [11]:
registrations = registrations.reset_index()

In [12]:
registrations

     name  reg_id
0  Andrew       1
1     Bob       2
2  Claire       3
3   David       4

In [14]:
registrations.columns = ['reg_name','reg_id']

In [15]:
registrations

  reg_name  reg_id
0   Andrew       1
1      Bob       2
2   Claire       3
3    David       4

In [16]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4      Bob

In [18]:
results = pd.merge(registrations,logins,how='inner',left_on = 'reg_name',right_on = 'name')

In [19]:
results.drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4     Bob

In [20]:
registrations.columns = ['name','id']

In [21]:
logins.columns = ['id','name']

In [22]:
registrations

     name  id
0  Andrew   1
1     Bob   2
2  Claire   3
3   David   4

In [24]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4      Bob

In [25]:
pd.merge(registrations,logins,how= 'inner',on = 'name')

     name  id_x  id_y
0  Andrew     1     2
1     Bob     2     4

In [26]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1     Bob       2       4